src/cf/InformationRegisters/ДатыИзмененияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ДатыИзмененияОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КонтролируемыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВерсионируемыйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ВерсииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ВерсииОбъектов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеОписания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеСхемы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеСправки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВерсионируемыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВерсионируемыйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КонтрольИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КонтрольИзменений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКонтроляОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонтроля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КонтролируемыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектСКонтролемИзменений</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СостоянияКонтроляОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СостоянияКонтроляОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаКонтроле</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроверено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСКонтроля</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/КонтрольИзменений/Ext/Module.bsl
// Общая процедура установки статуса контроля, переданного в качестве параметра
//
Процедура УстановитьСтатусКонтроля(Ссылка, ВидОбъекта, ТекущийПользователь, СтатусКонтроля) Экспорт
	
	// Определяется, когда последний раз изменялся контролируемый объект
	
	ЗаписьДатыИзменения = РегистрыСведений.ДатыИзмененияОбъектов.СоздатьМенеджерЗаписи();
	
	ЗаписьДатыИзменения.КонтролируемыйОбъект = Ссылка;
	ЗаписьДатыИзменения.ВидОбъекта = ВидОбъекта;
	
	ЗаписьДатыИзменения.Прочитать();
	
	// Если запись изменения не найдена, она регистрируется текущим временем
	
	Если НЕ ЗаписьДатыИзменения.Выбран() Тогда
		ЗаписьДатыИзменения = РегистрыСведений.ДатыИзмененияОбъектов.СоздатьМенеджерЗаписи();
		
		ЗаписьДатыИзменения.КонтролируемыйОбъект = Ссылка;
		ЗаписьДатыИзменения.ДатаИзменения        = ТекущаяДата();
		ЗаписьДатыИзменения.Комментарии          = "";
		ЗаписьДатыИзменения.Пользователь         = Справочники.Пользователи.ПустаяСсылка();
		ЗаписьДатыИзменения.ВидОбъекта           = ВидОбъекта;
		
		ЗаписьДатыИзменения.Записать(Истина);
	КонецЕсли;
	
	// Если объект ставится на контроль, то принудительно записывается версия, если ее не было
	
	Если СтатусКонтроля = Перечисления.СостоянияКонтроляОбъектов.НаКонтроле Тогда
		ЗаписьВерсииОбъекта = РегистрыСведений.ВерсииОбъектов.СоздатьМенеджерЗаписи();
		
		ЗаписьВерсииОбъекта.Период               = ЗаписьДатыИзменения.ДатаИзменения;
		ЗаписьВерсииОбъекта.ВерсионируемыйОбъект = Ссылка;
		ЗаписьВерсииОбъекта.ВидОбъекта           = ВидОбъекта;
		
		ЗаписьВерсииОбъекта.Прочитать();
		
		Если НЕ ЗаписьВерсииОбъекта.Выбран() Тогда
			ЗаписьВерсииОбъекта.Период               = ЗаписьДатыИзменения.ДатаИзменения;
			ЗаписьВерсииОбъекта.ВерсионируемыйОбъект = Ссылка;
			ЗаписьВерсииОбъекта.Пользователь         = ЗаписьДатыИзменения.Пользователь;
			ЗаписьВерсииОбъекта.ВидОбъекта           = ВидОбъекта;
			
			Версионирование.ЗаполнитьХранилищеВерсии(ЗаписьВерсииОбъекта);
			
			ЗаписьВерсииОбъекта.Записать(Ложь);
		КонецЕсли;
	КонецЕсли;
	
	// Записывается статус контроля
	
	ЗаписьКонтроляИзменений = РегистрыСведений.КонтрольИзменений.СоздатьМенеджерЗаписи();
	
	ЗаписьКонтроляИзменений.КонтролируемыйОбъект = Ссылка;
	ЗаписьКонтроляИзменений.Пользователь         = ТекущийПользователь;
	ЗаписьКонтроляИзменений.СтатусКонтроля       = СтатусКонтроля;
	ЗаписьКонтроляИзменений.ДатаКонтроля         = ЗаписьДатыИзменения.ДатаИзменения;
	ЗаписьКонтроляИзменений.ВидОбъекта           = ЗаписьДатыИзменения.ВидОбъекта;
	
	ЗаписьКонтроляИзменений.Записать(Истина);

КонецПроцедуры

// Определяет и возвращает статус контроля объекта
//
// Параметры:
//  Объект - контрлируемый объект, статус которого требуется определить
//
// Возвращаемое значение:
//  Строка- статус объекта
//
Функция СтатусКонтроля(Объект, ВидОбъекта = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ДатыИзмененияОбъектов.ДатаИзменения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИзменения,
	|	КонтрольИзменений.СтатусКонтроля КАК СтатусКонтроля,
	|	КонтрольИзменений.ДатаКонтроля КАК ДатаКонтроля
	|ИЗ
	|	РегистрСведений.КонтрольИзменений КАК КонтрольИзменений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыИзмененияОбъектов КАК ДатыИзмененияОбъектов
	|		ПО КонтрольИзменений.КонтролируемыйОбъект = ДатыИзмененияОбъектов.КонтролируемыйОбъект
	|ГДЕ
	|	КонтрольИзменений.Пользователь = &ТекущийПользователь
	|	И КонтрольИзменений.КонтролируемыйОбъект = &КонтролируемыйОбъект
	|	И КонтрольИзменений.ВидОбъекта = &ВидОбъекта";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("КонтролируемыйОбъект", Объект);
	Запрос.УстановитьПараметр("ВидОбъекта", ?(ВидОбъекта <> Неопределено, ВидОбъекта, Версионирование.ВидВерсионируемогоОбъекта(Объект)));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.СтатусКонтроля = Перечисления.СостоянияКонтроляОбъектов.НеПроверено Тогда
			Возврат "Не проверено";
		ИначеЕсли Выборка.СтатусКонтроля = Перечисления.СостоянияКонтроляОбъектов.СнятоСКонтроля Тогда
			Возврат "Снято с контроля";
		ИначеЕсли Выборка.СтатусКонтроля = Перечисления.СостоянияКонтроляОбъектов.НаКонтроле Тогда
			Если Выборка.ДатаКонтроля < Выборка.ДатаИзменения Тогда
				Возврат "Изменено";
			Иначе
				Возврат "Проверено";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат "Добавлено";
	
КонецФункции

Процедура УстановитьУсловноеОформлениеСпискаСостояниеКонтроля(УсловноеОформлениеСписка) Экспорт
	
	// Установка представления и цвета сосояния контроля объекта в списке
	
	ЦветТекстаИзмененных      = Метаданные.ЭлементыСтиля.ЦветТекстаПросроченныхЭлементов.Значение;
	ЦветТекстаСнятыхСКонтроля = Метаданные.ЭлементыСтиля.ЦветТекстаСнятыхСКонтроляОбъектов.Значение;
	ЦветТекстаПроверенных     = Метаданные.ЭлементыСтиля.ЦветТекстаПроверенныхКонтролируемыхОбъектов.Значение;
	
	ТипЭлементОтбора  = Тип("ЭлементОтбораКомпоновкиДанных");
	
	// Добавленные
	ЭлементОформления = УсловноеОформлениеСписка.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru='Выделение текстом добавленных объектов'");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(ТипЭлементОтбора);
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СостояниеКонтроля");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементЦвета = ЭлементОформления.Оформление.Элементы.Найти("ЦветТекста");
	ЭлементЦвета.Значение = ЦветТекстаИзмененных;
	ЭлементЦвета.Использование = Истина;
	
	ЭлементТекста = ЭлементОформления.Оформление.Элементы.Найти("Текст");
	ЭлементТекста.Значение = НСтр("ru = 'Добавлено'");
	ЭлементТекста.Использование = Истина;
	
	ЭлементОбласти = ЭлементОформления.Поля.Элементы.Добавить();
	ЭлементОбласти.Поле = Новый ПолеКомпоновкиДанных("СостояниеКонтроля");
	ЭлементОбласти.Использование = Истина;
	
	// Снятые с контроля
	ЭлементОформления = УсловноеОформлениеСписка.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru='Выделение текстом снятых с контроля объектов'");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(ТипЭлементОтбора);
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СостояниеКонтроля");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.СостоянияКонтроляОбъектов.СнятоСКонтроля;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементЦвета = ЭлементОформления.Оформление.Элементы.Найти("ЦветТекста");
	ЭлементЦвета.Значение =  ЦветТекстаСнятыхСКонтроля;
	ЭлементЦвета.Использование = Истина;
	
	ЭлементТекста = ЭлементОформления.Оформление.Элементы.Найти("Текст");
	ЭлементТекста.Значение = НСтр("ru = 'Снято с контроля'");
	ЭлементТекста.Использование = Истина;
	
	ЭлементОбласти = ЭлементОформления.Поля.Элементы.Добавить();
	ЭлементОбласти.Поле = Новый ПолеКомпоновкиДанных("СостояниеКонтроля");
	ЭлементОбласти.Использование = Истина;
	
	// Непроверенные
	ЭлементОформления = УсловноеОформлениеСписка.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru='Выделение текстом непроверенных объектов'");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(ТипЭлементОтбора);
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СостояниеКонтроля");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.СостоянияКонтроляОбъектов.НеПроверено;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементЦвета = ЭлементОформления.Оформление.Элементы.Найти("ЦветТекста");
	ЭлементЦвета.Значение = ЦветТекстаИзмененных;
	ЭлементЦвета.Использование = Истина;
	
	ЭлементТекста = ЭлементОформления.Оформление.Элементы.Найти("Текст");
	ЭлементТекста.Значение = НСтр("ru = 'Не проверено'");
	ЭлементТекста.Использование = Истина;
	
	ЭлементОбласти = ЭлементОформления.Поля.Элементы.Добавить();
	ЭлементОбласти.Поле = Новый ПолеКомпоновкиДанных("СостояниеКонтроля");
	ЭлементОбласти.Использование = Истина;
	
	// Проверенные
	ЭлементОформления = УсловноеОформлениеСписка.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru='Выделение текстом проверенных объектов'");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(ТипЭлементОтбора);
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СостояниеКонтроля");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.СостоянияКонтроляОбъектов.НаКонтроле;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(ТипЭлементОтбора);
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЕстьИзменения");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементЦвета = ЭлементОформления.Оформление.Элементы.Найти("ЦветТекста");
	ЭлементЦвета.Значение = ЦветТекстаПроверенных;
	ЭлементЦвета.Использование = Истина;
	
	ЭлементТекста = ЭлементОформления.Оформление.Элементы.Найти("Текст");
	ЭлементТекста.Значение = НСтр("ru = 'Проверено'");
	ЭлементТекста.Использование = Истина;
	
	ЭлементОбласти = ЭлементОформления.Поля.Элементы.Добавить();
	ЭлементОбласти.Поле = Новый ПолеКомпоновкиДанных("СостояниеКонтроля");
	ЭлементОбласти.Использование = Истина;
	
	// Измененные
	ЭлементОформления = УсловноеОформлениеСписка.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru='Выделение текстом измененных объектов'");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(ТипЭлементОтбора);
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СостояниеКонтроля");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.СостоянияКонтроляОбъектов.НаКонтроле;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(ТипЭлементОтбора);
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЕстьИзменения");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементЦвета = ЭлементОформления.Оформление.Элементы.Найти("ЦветТекста");
	ЭлементЦвета.Значение = ЦветТекстаИзмененных;
	ЭлементЦвета.Использование = Истина;
	
	ЭлементТекста = ЭлементОформления.Оформление.Элементы.Найти("Текст");
	ЭлементТекста.Значение = НСтр("ru = 'Изменено'");
	ЭлементТекста.Использование = Истина;
	
	ЭлементОбласти = ЭлементОформления.Поля.Элементы.Добавить();
	ЭлементОбласти.Поле = Новый ПолеКомпоновкиДанных("СостояниеКонтроля");
	ЭлементОбласти.Использование = Истина;
	
КонецПроцедуры
